output/posts/useful-network-debugging-tools/index.org
#+BEGIN_COMMENT
.. title: Useful Network debugging Tools
.. slug: useful-network-debugging-tools
.. date: 2020-03-15 08:33:59 UTC+01:00
.. tags: 
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT

#+BEGIN_EXPORT html
<br>
<br>
#+END_EXPORT

There are many handy tools you can leverage when debugging your
network. This is a brief list with possible commands to keep the
performance of your network under track and to identify the piece of
the network it is failing; i.e. whether it is a DNS, WebServer, DHCP
error or whatever. 

It moreover illustrates handy tools through which you can gain a
better understanding of internet protocols as you are able to open
individuals packages and frames at the different layers and observe
their payloads and headers.

{{{TEASER_END}}}


#+BEGIN_EXPORT html
<br>
#+END_EXPORT

* Ping
:PROPERTIES:
:header-args:shell: :exports both
:END:

This is a UNIX command that checks whether a destination is reachable.

As stated on Wikipedia:

#+begin_quote
Ping operates by sending Internet Control Message Protocol echo
request packets to the target host and waiting for an ICMP echo
reply. The program reports errors, packet loss, and a statistical
summary of the results, typically including the minimum, maximum, the
mean round-trip times, and standard deviation of the mean. 
#+end_quote


Interesting is moreover the option to customize the ping command with
the size of the payload, count of tests, the limit for the number of
network hops (TTL) that probes traverse, interval between the requests
and time to wait for a response.

Many systems provide a companion utility ping6, for testing on
Internet Protocol version 6 (IPv6) networks, which implement ICMPv6.


#+BEGIN_SRC sh :results output :exports both
ping google.com
#+END_SRC

#+RESULTS: 
#+begin_example
PING google.com (216.58.206.46): 56 data bytes
64 bytes from 216.58.206.46: icmp_seq=0 ttl=53 time=11.902 ms
64 bytes from 216.58.206.46: icmp_seq=1 ttl=53 time=2.523 ms
64 bytes from 216.58.206.46: icmp_seq=2 ttl=53 time=4.955 ms
64 bytes from 216.58.206.46: icmp_seq=3 ttl=53 time=8.905 ms
64 bytes from 216.58.206.46: icmp_seq=4 ttl=53 time=29.452 msping google.com
#+end_example


Setting the maximum amount of hops with the =-m= flag you can see for
instance what happens when the maximum amount specified is exceeded.

#+BEGIN_SRC sh :results output :exports both
ping google.com -m 10
#+END_SRC

#+RESULTS: 
#+begin_example
PING google.com (172.217.21.78): 56 data bytes
76 bytes from 62-101-124-125.fastres.net (62.101.124.125): Time to live exceeded
Vr HL TOS  Len   ID Flg  off TTL Pro  cks      Src      Dst
 4  5  00 5400 c17a   0 0000  01  01 7406 192.168.1.89  172.217.21.78 

Request timeout for icmp_seq 0
76 bytes from 62-101-124-125.fastres.net (62.101.124.125): Time to live exceeded
Vr HL TOS  Len   ID Flg  off TTL Pro  cks      Src      Dst
 4  5  00 5400 d583   0 0000  01  01 5ffd 192.168.1.89  172.217.21.78 
#+end_example

#+BEGIN_EXPORT html
<br>
#+END_EXPORT

