output/posts/useful-network-debugging-tools/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Useful Network debugging Tools | Bits of Experience</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://marcohassan.github.io/bits-of-experience/posts/useful-network-debugging-tools/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Marco Hassan">
<link rel="prev" href="../shell-scripts-and-interactive-shell/" title="Shell Scripts and Interactive Shell" type="text/html">
<link rel="next" href="../python-eda/" title="Python EDA" type="text/html">
<meta property="og:site_name" content="Bits of Experience">
<meta property="og:title" content="Useful Network debugging Tools">
<meta property="og:url" content="https://marcohassan.github.io/bits-of-experience/posts/useful-network-debugging-tools/">
<meta property="og:description" content="There are many handy tools you can leverage when debugging your
network. This is a brief list with possible commands to keep the
performance of your network under track and to identify the piece of
th">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-03-15T08:33:59+01:00">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">Skip to main content</a>
    
    <section class="social"><ul>
<li><a href="../../pages/aboutme/" title="About me"><i class="fa fa-user-circle"></i></a></li>
            <li><a href="../../pages/bits-of-experience-a-readable-view-on-my-study-adventures/" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../index.html" title="Blog"><i class="fa fa-edit"></i></a></li>
            <li><a href="../../pages/emacs/" title="A life Configuring Emacs"><i class="fa fa-code"></i></a></li>
            <li><a href="../../pages/papers/" title="Term and Research Papers"><i class="fa fa-university"></i></a></li>
            <li><a href="../../pages/foto-blog/" title="Foto Blog"><i class="fa fa-camera-retro"></i></a></li>
            <li><a href="https://github.com/MarcoHassan" title="My Github"><i class="fab fa-github"></i></a></li>
            <li><a href="https://stackoverflow.com/users/9731177/mhass" title="My Stack"><i class="fab fa-stack-overflow"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Useful Network debugging Tools</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2020-03-15T08:33:59+01:00" itemprop="datePublished" title="2020-03-15 08:33">2020-03-15 08:33</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Marco Hassan
            </span></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> Source</a></p>

            

            

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <br><br><p>
There are many handy tools you can leverage when debugging your
network. This is a brief list with possible commands to keep the
performance of your network under track and to identify the piece of
the network it is failing; i.e. whether it is a DNS, WebServer, DHCP
error or whatever. 
</p>

<p>
It moreover illustrates handy tools through which you can gain a
better understanding of internet protocols as you are able to open
individuals packages and frames at the different layers and observe
their payloads and headers.
</p>

<!-- TEASER_END -->


<br><div id="outline-container-org1085db6" class="outline-2">
<h2 id="org1085db6">Ping</h2>
<div class="outline-text-2" id="text-org1085db6">
<p>
This is a UNIX command that checks whether a destination is reachable.
</p>

<p>
As stated on Wikipedia:
</p>

<blockquote>
<p>
Ping operates by sending Internet Control Message Protocol echo
request packets to the target host and waiting for an ICMP echo
reply. The program reports errors, packet loss, and a statistical
summary of the results, typically including the minimum, maximum, the
mean round-trip times, and standard deviation of the mean. 
</p>
</blockquote>


<p>
Interesting is moreover the option to customize the ping command with
the size of the payload, count of tests, the limit for the number of
network hops (TTL) that probes traverse, interval between the requests
and time to wait for a response.
</p>

<p>
Many systems provide a companion utility ping6, for testing on
Internet Protocol version 6 (IPv6) networks, which implement ICMPv6.
</p>


<div class="highlight"><pre><span></span>ping google.com
</pre></div>

<pre class="example" id="org97ce417">
PING google.com (216.58.206.46): 56 data bytes
64 bytes from 216.58.206.46: icmp_seq=0 ttl=53 time=11.902 ms
64 bytes from 216.58.206.46: icmp_seq=1 ttl=53 time=2.523 ms
64 bytes from 216.58.206.46: icmp_seq=2 ttl=53 time=4.955 ms
64 bytes from 216.58.206.46: icmp_seq=3 ttl=53 time=8.905 ms
64 bytes from 216.58.206.46: icmp_seq=4 ttl=53 time=29.452 msping google.com
</pre>


<p>
Setting the maximum amount of hops with the <code>-m</code> flag you can see for
instance what happens when the maximum amount specified is exceeded.
</p>

<div class="highlight"><pre><span></span>ping google.com -m <span class="m">10</span>
</pre></div>

<pre class="example" id="org30df03c">
PING google.com (172.217.21.78): 56 data bytes
76 bytes from 62-101-124-125.fastres.net (62.101.124.125): Time to live exceeded
Vr HL TOS  Len   ID Flg  off TTL Pro  cks      Src      Dst
 4  5  00 5400 c17a   0 0000  01  01 7406 192.168.1.89  172.217.21.78 

Request timeout for icmp_seq 0
76 bytes from 62-101-124-125.fastres.net (62.101.124.125): Time to live exceeded
Vr HL TOS  Len   ID Flg  off TTL Pro  cks      Src      Dst
 4  5  00 5400 d583   0 0000  01  01 5ffd 192.168.1.89  172.217.21.78 
</pre>

<br>
</div>
</div>
