output/posts/useful-network-debugging-tools/index.org
* Ifconfig

This is a UNIX basic command to check all of the interfaces on your
device.

#+BEGIN_SRC sh :exports code
ifconfig
#+END_SRC

#+RESULTS:
| lo0:     | flags=8049<UP,LOOPBACK,RUNNING,MULTICAST>                        | mtu                             | 16384                      |                |           |               |        |          |      |         |      |
|          | options=1203<RXCSUM,TXCSUM,TXSTATUS,SW_TIMESTAMP>                |                                 |                            |                |           |               |        |          |      |         |      |
|          | inet                                                             | 127.0.0.1                       | netmask                    |     0xff000000 |           |               |        |          |      |         |      |
|          | inet6                                                            | ::1                             | prefixlen                  |            128 |           |               |        |          |      |         |      |
|          | inet6                                                            | fe80::1%lo0                     | prefixlen                  |             64 | scopeid   |           0x1 |        |          |      |         |      |
|          | nd6                                                              | options=201<PERFORMNUD,DAD>     |                            |                |           |               |        |          |      |         |      |
| gif0:    | flags=8010<POINTOPOINT,MULTICAST>                                | mtu                             | 1280                       |                |           |               |        |          |      |         |      |
| stf0:    | flags=0<>                                                        | mtu                             | 1280                       |                |           |               |        |          |      |         |      |
| en5:     | flags=8863<UP,BROADCAST,SMART,RUNNING,SIMPLEX,MULTICAST>         | mtu                             | 1500                       |                |           |               |        |          |      |         |      |
|          | ether                                                            | ac:de:48:00:11:22               |                            |                |           |               |        |          |      |         |      |
|          | inet6                                                            | fe80::aede:48ff:fe00:1122%en5   | prefixlen                  |             64 | scopeid   |           0x4 |        |          |      |         |      |
|          | nd6                                                              | options=201<PERFORMNUD,DAD>     |                            |                |           |               |        |          |      |         |      |
|          | media:                                                           | autoselect                      | (100baseTX                 | <full-duplex>) |           |               |        |          |      |         |      |
|          | status:                                                          | active                          |                            |                |           |               |        |          |      |         |      |
| ap1:     | flags=8843<UP,BROADCAST,RUNNING,SIMPLEX,MULTICAST>               | mtu                             | 1500                       |                |           |               |        |          |      |         |      |
|          | options=400<CHANNEL_IO>                                          |                                 |                            |                |           |               |        |          |      |         |      |
|          | ether                                                            | f2:18:98:58:ec:9f               |                            |                |           |               |        |          |      |         |      |
|          | nd6                                                              | options=201<PERFORMNUD,DAD>     |                            |                |           |               |        |          |      |         |      |
|          | media:                                                           | autoselect                      |                            |                |           |               |        |          |      |         |      |
|          | status:                                                          | inactive                        |                            |                |           |               |        |          |      |         |      |
| en0:     | flags=8963<UP,BROADCAST,SMART,RUNNING,PROMISC,SIMPLEX,MULTICAST> | mtu                             | 1500                       |                |           |               |        |          |      |         |      |
|          | options=400<CHANNEL_IO>                                          |                                 |                            |                |           |               |        |          |      |         |      |
|          | ether                                                            | f0:18:98:58:ec:9f               |                            |                |           |               |        |          |      |         |      |
|          | inet6                                                            | fe80::1c99:92c5:bc23:d8bb%en0   | prefixlen                  |             64 | secured   |       scopeid | 0x6    |          |      |         |      |
|          | inet                                                             | 192.168.1.89                    | netmask                    |     0xffffff00 | broadcast | 192.168.1.255 |        |          |      |         |      |
|          | nd6                                                              | options=201<PERFORMNUD,DAD>     |                            |                |           |               |        |          |      |         |      |
|          | media:                                                           | autoselect                      |                            |                |           |               |        |          |      |         |      |
|          | status:                                                          | active                          |                            |                |           |               |        |          |      |         |      |
| p2p0:    | flags=8843<UP,BROADCAST,RUNNING,SIMPLEX,MULTICAST>               | mtu                             | 2304                       |                |           |               |        |          |      |         |      |
|          | options=400<CHANNEL_IO>                                          |                                 |                            |                |           |               |        |          |      |         |      |
|          | ether                                                            | 02:18:98:58:ec:9f               |                            |                |           |               |        |          |      |         |      |
|          | media:                                                           | autoselect                      |                            |                |           |               |        |          |      |         |      |
|          | status:                                                          | inactive                        |                            |                |           |               |        |          |      |         |      |
| awdl0:   | flags=8943<UP,BROADCAST,RUNNING,PROMISC,SIMPLEX,MULTICAST>       | mtu                             | 1484                       |                |           |               |        |          |      |         |      |
|          | options=400<CHANNEL_IO>                                          |                                 |                            |                |           |               |        |          |      |         |      |
|          | ether                                                            | 3a:7c:23:43:38:aa               |                            |                |           |               |        |          |      |         |      |
|          | inet6                                                            | fe80::387c:23ff:fe43:38aa%awdl0 | prefixlen                  |             64 | scopeid   |           0x8 |        |          |      |         |      |
|          | nd6                                                              | options=201<PERFORMNUD,DAD>     |                            |                |           |               |        |          |      |         |      |
|          | media:                                                           | autoselect                      |                            |                |           |               |        |          |      |         |      |
|          | status:                                                          | active                          |                            |                |           |               |        |          |      |         |      |
| llw0:    | flags=8863<UP,BROADCAST,SMART,RUNNING,SIMPLEX,MULTICAST>         | mtu                             | 1500                       |                |           |               |        |          |      |         |      |
|          | options=400<CHANNEL_IO>                                          |                                 |                            |                |           |               |        |          |      |         |      |
|          | ether                                                            | 3a:7c:23:43:38:aa               |                            |                |           |               |        |          |      |         |      |
|          | inet6                                                            | fe80::387c:23ff:fe43:38aa%llw0  | prefixlen                  |             64 | scopeid   |           0x9 |        |          |      |         |      |
|          | nd6                                                              | options=201<PERFORMNUD,DAD>     |                            |                |           |               |        |          |      |         |      |
|          | media:                                                           | autoselect                      |                            |                |           |               |        |          |      |         |      |
|          | status:                                                          | active                          |                            |                |           |               |        |          |      |         |      |
| en1:     | flags=8963<UP,BROADCAST,SMART,RUNNING,PROMISC,SIMPLEX,MULTICAST> | mtu                             | 1500                       |                |           |               |        |          |      |         |      |
|          | options=460<TSO4,TSO6,CHANNEL_IO>                                |                                 |                            |                |           |               |        |          |      |         |      |
|          | ether                                                            | 82:21:8b:80:2c:01               |                            |                |           |               |        |          |      |         |      |
|          | media:                                                           | autoselect                      | <full-duplex>              |                |           |               |        |          |      |         |      |
|          | status:                                                          | inactive                        |                            |                |           |               |        |          |      |         |      |
| en2:     | flags=8963<UP,BROADCAST,SMART,RUNNING,PROMISC,SIMPLEX,MULTICAST> | mtu                             | 1500                       |                |           |               |        |          |      |         |      |
|          | options=460<TSO4,TSO6,CHANNEL_IO>                                |                                 |                            |                |           |               |        |          |      |         |      |
|          | ether                                                            | 82:21:8b:80:2c:00               |                            |                |           |               |        |          |      |         |      |
|          | media:                                                           | autoselect                      | <full-duplex>              |                |           |               |        |          |      |         |      |
|          | status:                                                          | inactive                        |                            |                |           |               |        |          |      |         |      |
| en3:     | flags=8963<UP,BROADCAST,SMART,RUNNING,PROMISC,SIMPLEX,MULTICAST> | mtu                             | 1500                       |                |           |               |        |          |      |         |      |
|          | options=460<TSO4,TSO6,CHANNEL_IO>                                |                                 |                            |                |           |               |        |          |      |         |      |
|          | ether                                                            | 82:21:8b:80:2c:05               |                            |                |           |               |        |          |      |         |      |
|          | media:                                                           | autoselect                      | <full-duplex>              |                |           |               |        |          |      |         |      |
|          | status:                                                          | inactive                        |                            |                |           |               |        |          |      |         |      |
| en4:     | flags=8963<UP,BROADCAST,SMART,RUNNING,PROMISC,SIMPLEX,MULTICAST> | mtu                             | 1500                       |                |           |               |        |          |      |         |      |
|          | options=460<TSO4,TSO6,CHANNEL_IO>                                |                                 |                            |                |           |               |        |          |      |         |      |
|          | ether                                                            | 82:21:8b:80:2c:04               |                            |                |           |               |        |          |      |         |      |
|          | media:                                                           | autoselect                      | <full-duplex>              |                |           |               |        |          |      |         |      |
|          | status:                                                          | inactive                        |                            |                |           |               |        |          |      |         |      |
| bridge0: | flags=8863<UP,BROADCAST,SMART,RUNNING,SIMPLEX,MULTICAST>         | mtu                             | 1500                       |                |           |               |        |          |      |         |      |
|          | options=63<RXCSUM,TXCSUM,TSO4,TSO6>                              |                                 |                            |                |           |               |        |          |      |         |      |
|          | ether                                                            | 82:21:8b:80:2c:01               |                            |                |           |               |        |          |      |         |      |
|          | Configuration:                                                   |                                 |                            |                |           |               |        |          |      |         |      |
|          |                                                                  | id                              | 0:0:0:0:0:0                |       priority | 0         |     hellotime | 0      | fwddelay |    0 |         |      |
|          |                                                                  | maxage                          | 0                          |        holdcnt | 0         |         proto | stp    | maxaddr  |  100 | timeout | 1200 |
|          |                                                                  | root                            | id                         |    0:0:0:0:0:0 | priority  |             0 | ifcost | 0        | port |       0 |      |
|          |                                                                  | ipfilter                        | disabled                   |          flags | 0x2       |               |        |          |      |         |      |
|          | member:                                                          | en1                             | flags=3<LEARNING,DISCOVER> |                |           |               |        |          |      |         |      |
|          | ifmaxaddr                                                        | 0                               | port                       |             10 | priority  |             0 | path   | cost     |    0 |         |      |
|          | member:                                                          | en2                             | flags=3<LEARNING,DISCOVER> |                |           |               |        |          |      |         |      |
|          | ifmaxaddr                                                        | 0                               | port                       |             11 | priority  |             0 | path   | cost     |    0 |         |      |
|          | member:                                                          | en3                             | flags=3<LEARNING,DISCOVER> |                |           |               |        |          |      |         |      |
|          | ifmaxaddr                                                        | 0                               | port                       |             12 | priority  |             0 | path   | cost     |    0 |         |      |
|          | member:                                                          | en4                             | flags=3<LEARNING,DISCOVER> |                |           |               |        |          |      |         |      |
|          | ifmaxaddr                                                        | 0                               | port                       |             13 | priority  |             0 | path   | cost     |    0 |         |      |
|          | nd6                                                              | options=201<PERFORMNUD,DAD>     |                            |                |           |               |        |          |      |         |      |
|          | media:                                                           | <unknown                        | type>                      |                |           |               |        |          |      |         |      |
|          | status:                                                          | inactive                        |                            |                |           |               |        |          |      |         |      |
| utun0:   | flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST>                     | mtu                             | 1380                       |                |           |               |        |          |      |         |      |
|          | inet6                                                            | fe80::4b4:adf0:e390:4fc4%utun0  | prefixlen                  |             64 | scopeid   |           0xf |        |          |      |         |      |
|          | nd6                                                              | options=201<PERFORMNUD,DAD>     |                            |                |           |               |        |          |      |         |      |
| utun1:   | flags=8051<UP,POINTOPOINT,RUNNING,MULTICAST>                     | mtu                             | 2000                       |                |           |               |        |          |      |         |      |
|          | inet6                                                            | fe80::d049:1fc3:1b6a:b767%utun1 | prefixlen                  |             64 | scopeid   |          0x10 |        |          |      |         |      |
|          | nd6                                                              | options=201<PERFORMNUD,DAD>     |                            |                |           |               |        |          |      |         |      |
| utun2:   | flags=80d1<UP,POINTOPOINT,RUNNING,NOARP,MULTICAST>               | mtu                             | 1406                       |                |           |               |        |          |      |         |      |
|          | inet                                                             | 9.145.55.158                    | -->                        |   9.145.55.158 | netmask   |    0xfffff000 |        |          |      |         |      |

It output a long table where you can check all the configurations of
multiple networks. For instance the =en0= is the wireless interface
and you can read there the configuration settings of it.

It is important moreover to understand that you can modify the
interface settings by issuing the proper networking commands. This
goes beyond the scope of the post and it is omitted here.

=utun= are interfaces created for communicating via VPN. I have
multiple of such interfaces as I configured multiple VPN: work, uni
etc. 

A particularly interesting statistics from the command are the various
=RX= entries. The explanation of each can be found in the following
[[https://goinbigdata.com/demystifying-ifconfig-and-network-interfaces-in-linux/][link]]. These provide in general statistics about packets collisions,
packets errors, packets dropped etc.

A useful way to check at all of the interfaces on your device and to
understand the hardware port nature of them run

#+BEGIN_SRC sh :exports both
networksetup -listallhardwareports
#+END_SRC

#+RESULTS:
#+begin_example
| Hardware            | Port:          | Wi-Fi             |        |
| Device:             | en0            |                   |        |
| Hardware            | Port:          | Bluetooth         |    PAN |
| Device:             | en6            |                   |        |
| Hardware            | Port:          | Thunderbolt       |      1 |
| Device:             | en1            |                   |        |
| Hardware            | Port:          | Thunderbolt       |      2 |
| Device:             | en2            |                   |        |
| Hardware            | Port:          | Thunderbolt       |      3 |
| Device:             | en3            |                   |        |
| Hardware            | Port:          | Thunderbolt       |      4 |
| Device:             | en4            |                   |        |
| Hardware            | Port:          | Thunderbolt       | Bridge |
| Device:             | bridge0        |                   |        |
| VLAN                | Configurations |                   |        |
| =================== |                |                   |        |
#+end_example

Thunderbolt are  hardware interfaces that allows the connection of
external peripherals to a computer on MAC. This are therefore the
interfaces used for connecting to Monitors etc.

The Thunderbolt bridge in contrast lets two Macs talk to one another
through the Thunderbolt port. This is probably used when activating
AirDrop; would have to verify this though.


