output/posts/useful-network-debugging-tools/index.html

<div id="outline-container-org26dca87" class="outline-2">
<h2 id="org26dca87">Ifconfig</h2>
<div class="outline-text-2" id="text-org26dca87">
<p>
This is a UNIX basic command to check all of the interfaces on your
device.
</p>

<div class="highlight"><pre><span></span>ifconfig
</pre></div>

<p>
It output a long table where you can check all the configurations of
multiple networks. For instance the <code>en0</code> is the wireless interface
and you can read there the configuration settings of it.
</p>

<p>
It is important moreover to understand that you can modify the
interface settings by issuing the proper networking commands. This
goes beyond the scope of the post and it is omitted here.
</p>

<p>
<code>utun</code> are interfaces created for communicating via VPN. I have
multiple of such interfaces as I configured multiple VPN: work, uni
etc. 
</p>

<p>
A particularly interesting statistics from the command are the various
<code>RX</code> entries. The explanation of each can be found in the following
<a href="https://goinbigdata.com/demystifying-ifconfig-and-network-interfaces-in-linux/">link</a>. These provide in general statistics about packets collisions,
packets errors, packets dropped etc.
</p>

<p>
A useful way to check at all of the interfaces on your device and to
understand the hardware port nature of them run
</p>

<div class="highlight"><pre><span></span>networksetup -listallhardwareports
</pre></div>

<pre class="example" id="org209ac9d">
| Hardware            | Port:          | Wi-Fi             |        |
| Device:             | en0            |                   |        |
| Hardware            | Port:          | Bluetooth         |    PAN |
| Device:             | en6            |                   |        |
| Hardware            | Port:          | Thunderbolt       |      1 |
| Device:             | en1            |                   |        |
| Hardware            | Port:          | Thunderbolt       |      2 |
| Device:             | en2            |                   |        |
| Hardware            | Port:          | Thunderbolt       |      3 |
| Device:             | en3            |                   |        |
| Hardware            | Port:          | Thunderbolt       |      4 |
| Device:             | en4            |                   |        |
| Hardware            | Port:          | Thunderbolt       | Bridge |
| Device:             | bridge0        |                   |        |
| VLAN                | Configurations |                   |        |
| =================== |                |                   |        |
</pre>

<p>
Thunderbolt are  hardware interfaces that allows the connection of
external peripherals to a computer on MAC. This are therefore the
interfaces used for connecting to Monitors etc.
</p>

<p>
The Thunderbolt bridge in contrast lets two Macs talk to one another
through the Thunderbolt port. This is probably used when activating
AirDrop; would have to verify this though.
</p>
</div>
</div>
